Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# workspace.creative_asset_ingestion_service.the_reference_image_exceeds_20_mib
source: The reference image exceeds 20 MiB and cannot be imported safely.
zh_hans: 参考图片超过 20 MiB，无法安全导入。

# workspace.creative_asset_ingestion_service.web_import
source: Web import
zh_hans: 网络导入

# workspace.creative_asset_ingestion_service.web_reference_image
source: Web reference image
zh_hans: 网络参考图

# workspace.current
source: Current workspace
zh_hans: 当前工作区

# workspace.empty
source: No workspaces
zh_hans: 暂无工作区

# workspace.empty.hint
source: Add a folder from Files or iCloud Drive to let the agent read and edit it safely.
zh_hans: 从“文件”或 iCloud Drive 添加一个文件夹，让 Agent 安全地读写它。

# workspace.engineering_file_preview.cannot_persist_conversation_binding
source: Could not persist the drawing assistant conversation binding.
zh_hans: 无法持久化图纸助手会话绑定。

# workspace.engineering_file_preview.cannot_persist_receipts
source: Could not persist the drawing apply receipt.
zh_hans: 无法持久化图纸应用回执。

# workspace.engineering_file_preview.cannot_persist_records
source: Could not persist the drawing assistant record.
zh_hans: 无法持久化图纸助手记录。

# workspace.engineering_review_sheet.current_selection
source: Current selection
zh_hans: 当前选择

# workspace.engineering_review_sheet.current_viewport
source: Current viewport
zh_hans: 当前视口

# workspace.engineering_review_sheet.entire_drawing
source: Entire drawing
zh_hans: 整张图纸

# workspace.engineering_review_sheet.scope_only_the_currently_selected_object
source: Scope: only the currently selected object; prefer referencing its handle and geometry.
zh_hans: 范围：仅当前选中的对象；请优先引用其句柄与几何。

# workspace.engineering_review_sheet.scope_structured_parsing_of_the_entire
source: Scope: structured parsing of the entire drawing.
zh_hans: 范围：整张图纸的结构化解析。

# workspace.engineering_review_sheet.scope_visible_content_in_the_current
source: Scope: visible content in the current viewport; screenshots are the primary evidence.
zh_hans: 范围：当前视口中的可见内容，截图为主证据。

# workspace.error.title
source: Workspace error
zh_hans: 工作区错误

# workspace.file_inspector_view.added_to_task_context
source: Added to task context
zh_hans: 已加入任务上下文

# workspace.file_inspector_view.authentication
source: Authentication
zh_hans: 认证

# workspace.file_inspector_view.choose_a_host
source: Choose a host
zh_hans: 请选择主机

# workspace.file_inspector_view.clean_up_cloud_workspaces_when_permanently
source: Clean up cloud workspaces when permanently deleting tasks
zh_hans: 永久删除任务时清理云工作区

# workspace.file_inspector_view.cloud_workspace
source: Cloud workspace
zh_hans: 云工作区

# workspace.file_inspector_view.cloud_workspaces_linked
source: %@ cloud workspaces linked
zh_hans: 已链接 %@ 个云工作区

# workspace.file_inspector_view.connect_and_save
source: Connect and save
zh_hans: 连接并保存

# workspace.file_inspector_view.connecting
source: Connecting…
zh_hans: 连接中…

# workspace.file_inspector_view.daemon_port
source: Daemon port
zh_hans: 守护程序端口

# workspace.file_inspector_view.daemon_workspace_id_relative_path
source: Daemon workspace ID / relative path
zh_hans: 守护程序工作区 ID / 相对路径

# workspace.file_inspector_view.display_name
source: Display name
zh_hans: 显示名称

# workspace.file_inspector_view.export_workspace
source: Export workspace
zh_hans: 导出工作区

# workspace.file_inspector_view.external_folders_linked
source: %@ external folders linked
zh_hans: 已链接 %@ 个外部文件夹

# workspace.file_inspector_view.import_an_entire_folder
source: Import an entire folder
zh_hans: 导入整个文件夹

# workspace.file_inspector_view.invalid_address_format
source: Invalid address format.
zh_hans: 地址格式无效。

# workspace.file_inspector_view.link
source: Link
zh_hans: 链接

# workspace.file_inspector_view.link_cloud_workspace
source: Link cloud workspace
zh_hans: 链接云工作区

# workspace.file_inspector_view.link_external_folder
source: Link external folder
zh_hans: 链接外部文件夹

# workspace.file_inspector_view.mount_read_only
source: Mount read-only
zh_hans: 只读挂载

# workspace.file_inspector_view.mount_smb_webdav
source: Mount SMB / WebDAV
zh_hans: 挂载 SMB / WebDAV

# workspace.file_inspector_view.mounted
source: Mounted
zh_hans: 已挂载

# workspace.file_inspector_view.network_storage
source: Network storage
zh_hans: 网络存储

# workspace.file_inspector_view.network_storages_mounted
source: %@ network storages mounted
zh_hans: 已挂载 %@ 个网络存储

# workspace.file_inspector_view.open_the_only_canvas_entry_in
source: Open the only canvas entry in this workspace
zh_hans: 打开这个工作区唯一的画布入口

# workspace.file_inspector_view.passwords_are_written_only_to_keychain
source: Passwords are written only to Keychain; mount configs, sync, logs and model context store only credential references.
zh_hans: 密码只写入 Keychain；挂载配置、同步、日志和模型上下文只保存凭据引用。

# workspace.file_inspector_view.permissions
source: Permissions
zh_hans: 权限

# workspace.file_inspector_view.protocol
source: Protocol
zh_hans: 协议

# workspace.file_inspector_view.read_only
source: Read only
zh_hans: 只读

# workspace.file_inspector_view.read_write
source: Read & write
zh_hans: 读写

# workspace.file_inspector_view.remote_subdirectory_optional
source: Remote subdirectory (optional)
zh_hans: 远程子目录（可选）

# workspace.file_inspector_view.source_control
source: Source Control
zh_hans: 源码管理

# workspace.file_inspector_view.the_first_write_action_still_goes
source: The first write action still goes through Floe's file-write approval.
zh_hans: 首次写操作仍会经过 Floe 的文件写入审批。

# workspace.file_inspector_view.this_only_creates_a_connection_marker
source: This only creates a connection marker. The model performs daemon bootstrap over a verified SSH host only after you explicitly request installation in a chat; the default service listens only on the remote loopback address and is accessed through the SSH tunnel.
zh_hans: 这里只创建连接标记。守护程序仅在你于对话中明确要求安装后，才由模型通过已验证的 SSH 主机执行引导；默认服务只监听远端回环地址，并通过 SSH 隧道访问。

# workspace.file_inspector_view.workspace_actions
source: Workspace actions
zh_hans: 工作区操作

# workspace.file_inspector_view.workspace_panel
source: Workspace Panel
zh_hans: 工作区面板

# workspace.file_inspector_view.writing_moving_and_deleting_are_prohibited
source: Writing, moving and deleting are prohibited.
zh_hans: 禁止写入、移动和删除。

# workspace.file_preview_view.open_in_editor
source: Open in Editor
zh_hans: 在编辑器中打开

# workspace.file_preview_view.preview_website
source: Preview Website
zh_hans: 预览网页

# workspace.file_tree_view.and_all_of_its_contents_will
source: “%@” and all of its contents will be deleted recursively. This cannot be undone.
zh_hans: 将递归删除“%@”及其中的全部内容，此操作不可撤销。

# workspace.file_tree_view.confirm_deletion
source: Confirm deletion?
zh_hans: 确认删除？

# workspace.file_tree_view.delete_items
source: Delete %@ items
zh_hans: 删除 %@ 项

# workspace.file_tree_view.delete_items.one
source: Delete %@ item
zh_hans: 删除 %@ 项

# workspace.file_tree_view.delete_the_selected_files
source: Delete the selected files?
zh_hans: 删除所选文件？

# workspace.file_tree_view.destination_path_including_file_name
source: Destination path (including file name)
zh_hans: 目标路径（包含文件名）

# workspace.file_tree_view.done_selecting
source: Done selecting
zh_hans: 完成选择

# workspace.file_tree_view.enter_a_destination_path_inside_the
source: Enter a destination path inside the current workspace.
zh_hans: 输入当前工作区内的目标路径。

# workspace.file_tree_view.folder_name
source: Folder name
zh_hans: 文件夹名称

# workspace.file_tree_view.move
source: Move
zh_hans: 移动

# workspace.file_tree_view.move_file
source: Move file
zh_hans: 移动文件

# workspace.file_tree_view.new_folder
source: New Folder
zh_hans: 新建文件夹

# workspace.file_tree_view.new_name
source: New name
zh_hans: 新名称

# workspace.file_tree_view.ok
source: OK
zh_hans: 确定

# workspace.file_tree_view.rename
source: Rename
zh_hans: 重命名

# workspace.file_tree_view.searching_file_names_and_text_content
source: Searching file names and text content…
zh_hans: 正在搜索文件名与文本内容…

# workspace.file_tree_view.select
source: Select
zh_hans: 选择

# workspace.file_tree_view.the_folder_includes_all_of_its
source: The folder includes all of its contents. This cannot be undone.
zh_hans: 文件夹包含其中全部内容，此操作不可撤销。

# workspace.file_tree_view.the_search_could_not_be_completed
source: The search could not be completed
zh_hans: 无法完成搜索

# workspace.file_tree_view.will_be_deleted_this_cannot_be
source: “%@” will be deleted. This cannot be undone.
zh_hans: 将删除“%@”，此操作不可撤销。

# workspace.git_hub_actions_job_center.github_denied_this_workflow_request_403
source: GitHub denied this workflow request (403). Reconnect GitHub with “Allow GitHub Actions workflow setup”, or use a fine-grained token with Contents, Actions and Workflows write access. Existing credentials are unchanged until you sign in again. (%@)
zh_hans: GitHub 拒绝了此工作流请求（403）。请重新登录并开启“允许配置 GitHub Actions 工作流”，或使用具备 Contents、Actions 与 Workflows 写入权限的细粒度令牌。已有凭据在重新登录前保持不变。 / GitHub denied this workflow request (403). Reconnect GitHub with “Allow GitHub Actions workflow setup”, or use a fine-grained token with Contents, Actions and Workflows write access. Existing credentials are unchanged until you sign in again. (%@)

# workspace.git_hub_actions_job_center.snapshot_exceeds_bytes
source: Snapshot exceeds %@ bytes.
zh_hans: 快照总大小超过上限 %@ 字节。

# workspace.git_hub_actions_job_center.snapshot_exceeds_bytes_2
source: Snapshot exceeds %@ bytes.
zh_hans: 快照总大小超过上限 %@ 字节。 / Snapshot exceeds %@ bytes.

# workspace.git_hub_actions_job_center.snapshot_exceeds_files
source: Snapshot exceeds %@ files.
zh_hans: 快照文件数超过上限 %@。

# workspace.git_hub_actions_job_center.snapshot_exceeds_files_2
source: Snapshot exceeds %@ files.
zh_hans: 快照文件数超过上限 %@。 / Snapshot exceeds %@ files.

# workspace.git_hub_actions_job_center.snapshot_is_empty_the_directory_has
source: Snapshot is empty: the directory has no eligible files.
zh_hans: 快照为空：所选目录没有可上传的普通文件。 / Snapshot is empty: the directory has no eligible files.

# workspace.i_d_e_language_run_view.1_guest_core
source: 1 guest core
zh_hans: 1 个客户机内核

# workspace.i_d_e_language_run_view.2_guest_cores
source: 2 guest cores
zh_hans: 2 个客户机内核

# workspace.i_d_e_language_run_view.3_guest_cores
source: 3 guest cores
zh_hans: 3 个客户机内核

# workspace.i_d_e_language_run_view.a_guest_is_already_running_in
source: A guest is already running in this environment but its granted core count cannot be read; to ensure it never silently runs at a different shape, this run requesting %@ cores was rejected.
zh_hans: 该环境已有客户机在运行，但无法读取其已授予的内核数；为确保不静默按其他形状运行，请求 %@ 个内核的本次运行已被拒绝。

# workspace.i_d_e_language_run_view.an_unresolved_edit_conflict_cancelled_the
source: An unresolved edit conflict cancelled the run
zh_hans: 存在未解决的编辑冲突，已取消运行

# workspace.i_d_e_language_run_view.another_guest_start_is_already_in
source: Another guest start is already in progress for this environment; nothing was started for this run. Wait for it to finish and run again.
zh_hans: 该环境已有另一次客户机启动正在进行；本次运行未启动任何东西，请等它结束后重试。

# workspace.i_d_e_language_run_view.automatic_by_declared_signals
source: Automatic (by declared signals)
zh_hans: 自动（按声明信号）

# workspace.i_d_e_language_run_view.awaiting_run_association
source: Awaiting run association
zh_hans: 等待关联运行

# workspace.i_d_e_language_run_view.build
source: Build
zh_hans: 编译构建

# workspace.i_d_e_language_run_view.can_only_run_on_a_configured
source: %@ can only run on a configured SSH host; please choose a target host
zh_hans: %@ 只能通过已配置的 SSH 主机运行，请选择目标主机

# workspace.i_d_e_language_run_view.cancel_requested_github_finalizes_the_run
source: Cancel requested; GitHub finalizes the run asynchronously and Floe keeps checking until it is cancelled.
zh_hans: 已请求取消；GitHub 会异步结束该运行，Floe 会继续核对直到确认 cancelled。

# workspace.i_d_e_language_run_view.cancelled
source: Cancelled
zh_hans: 已取消

# workspace.i_d_e_language_run_view.cancelling
source: Cancelling
zh_hans: 取消中

# workspace.i_d_e_language_run_view.choose_the_github_repository_to_run
source: Choose the GitHub repository to run CI on
zh_hans: 请选择要运行 CI 的 GitHub 仓库

# workspace.i_d_e_language_run_view.completed
source: Completed
zh_hans: 已完成

# workspace.i_d_e_language_run_view.could_not_probe_the_remote_executable
source: Could not probe the remote executable; no run command was sent
zh_hans: 无法探测远端可执行文件，未发送运行命令

# workspace.i_d_e_language_run_view.could_not_resolve_this_workspace_s
source: Could not resolve this workspace's execution environment; the local run was not started
zh_hans: 无法解析本工作区的执行环境，已取消本地运行（未打开终端）

# workspace.i_d_e_language_run_view.dispatched_awaiting_run
source: Dispatched, awaiting run
zh_hans: 已触发，等待运行记录

# workspace.i_d_e_language_run_view.failed
source: Failed
zh_hans: 失败

# workspace.i_d_e_language_run_view.files_will_be_uploaded_excluded
source: %@ files (%@) will be uploaded; %@ excluded.
zh_hans: 将上传 %@ 个文件（%@）；排除 %@ 个。

# workspace.i_d_e_language_run_view.files_will_be_uploaded_excluded.one
source: %@ file (%@) will be uploaded; %@ excluded.
zh_hans: 将上传 %@ 个文件（%@）；排除 %@ 个。

# workspace.i_d_e_language_run_view.github_actions_cloud_build
source: GitHub Actions cloud build
zh_hans: GitHub Actions 云端构建

# workspace.i_d_e_language_run_view.github_actions_dispatched_associating_the_run
source: GitHub Actions dispatched; associating the run
zh_hans: 已触发 GitHub Actions，正在关联运行记录

# workspace.i_d_e_language_run_view.github_actions_does_not_yet_support
source: GitHub Actions does not yet support running %@
zh_hans: GitHub Actions 暂不支持运行 %@

# workspace.i_d_e_language_run_view.github_is_not_connected_sign_in
source: GitHub is not connected; sign in under Settings
zh_hans: 尚未连接 GitHub，请在设置中登录

# workspace.i_d_e_language_run_view.lint_test
source: Lint/test
zh_hans: Lint/测试

# workspace.i_d_e_language_run_view.local_run_ended_exit_code
source: Local run ended (exit code %@)
zh_hans: 本地运行已结束（退出码 %@）

# workspace.i_d_e_language_run_view.local_run_finished
source: Local run finished
zh_hans: 本地运行已结束

# workspace.i_d_e_language_run_view.no_executable_exists_on_the_remote
source: No executable %@ exists on the remote host; no run command was sent
zh_hans: 远端主机上没有可执行的 %@，未发送运行命令

# workspace.i_d_e_language_run_view.no_file_is_open
source: No file is open
zh_hans: 没有打开的文件

# workspace.i_d_e_language_run_view.no_reachable_floe_remote_agent_on
source: No reachable Floe remote agent on this host, so the verified source transfer cannot run
zh_hans: 该主机上没有可连接的 Floe 远程助手，无法完成已校验的源码传输

# workspace.i_d_e_language_run_view.no_snapshot_yet
source: No snapshot yet
zh_hans: 尚无快照

# workspace.i_d_e_language_run_view.no_ssh_host_is_configured
source: No SSH host is configured
zh_hans: 没有已配置的 SSH 主机

# workspace.i_d_e_language_run_view.on_device_runtime
source: On-device runtime
zh_hans: 本机运行时

# workspace.i_d_e_language_run_view.preparing_the_run_save_probe_verified
source: Preparing the run (save, probe, verified transfer)…
zh_hans: 正在准备运行（保存、探测、校验传输）…

# workspace.i_d_e_language_run_view.publishing_the_snapshot_and_dispatching_github
source: Publishing the snapshot and dispatching GitHub Actions…
zh_hans: 正在发布快照并触发 GitHub Actions…

# workspace.i_d_e_language_run_view.queued
source: Queued
zh_hans: 排队中

# workspace.i_d_e_language_run_view.remote_compile_run
source: Remote compile & run
zh_hans: 远程编译运行

# workspace.i_d_e_language_run_view.remote_interpreter
source: Remote interpreter
zh_hans: 远程解释运行

# workspace.i_d_e_language_run_view.run_preparation_was_cancelled
source: Run preparation was cancelled.
zh_hans: 已取消运行准备。

# workspace.i_d_e_language_run_view.running
source: Running
zh_hans: 运行中

# workspace.i_d_e_language_run_view.running_files_is_not_supported_yet
source: Running .%@ files is not supported yet
zh_hans: 暂不支持运行 .%@ 文件

# workspace.i_d_e_language_run_view.running_in_the_local_terminal
source: Running in the local terminal
zh_hans: 已在本地终端运行

# workspace.i_d_e_language_run_view.running_on_the_remote_host_source
source: Running on the remote host (source staged and verified)
zh_hans: 正在远程主机上运行（源码已校验传输）

# workspace.i_d_e_language_run_view.saving_the_current_file_failed_the
source: Saving the current file failed; the run was cancelled
zh_hans: 保存当前文件失败，已取消运行

# workspace.i_d_e_language_run_view.snapshot_published
source: Snapshot published
zh_hans: 快照已发布

# workspace.i_d_e_language_run_view.stop_was_requested_for_this_remote
source: Stop was requested for this remote run; the remote process exit, the SSH client close and the staging cleanup are not confirmed.
zh_hans: 已请求停止本次远程运行；无法确认远端进程是否退出、SSH 客户端是否关闭或暂存目录是否已清理。

# workspace.i_d_e_language_run_view.stopped_this_local_run
source: Stopped this local run
zh_hans: 已停止本次本地运行

# workspace.i_d_e_language_run_view.the_current_image_manifest_does_not
source: The current image manifest does not certify support for %@ cores, so the resource pool rejects the request; it never silently runs with fewer cores.
zh_hans: 当前镜像清单没有证明支持 %@ 核，资源池会拒绝该请求；不会静默降核运行。

# workspace.i_d_e_language_run_view.the_declared_signals_do_not_ask
source: The declared signals do not ask for parallelism: this run starts with 1 guest core.
zh_hans: 声明信号未要求并行：本次以 1 个客户机内核启动。

# workspace.i_d_e_language_run_view.the_declared_signals_recommend_2_cores
source: The declared signals recommend 2 cores, but only 1 can be delivered. This run starts with 1 guest core.
zh_hans: 声明信号推荐 2 核，但当前只能交付 1 核。本次将以 1 个客户机内核启动。

# workspace.i_d_e_language_run_view.the_declared_signals_support_parallelism_this
source: The declared signals support parallelism: this will start with 2 guest cores. Dual-core has passed S0–S4 correctness, but equivalent-work benchmarks are slower on 2 cores (about %@); use it only when the task genuinely benefits from parallelism.
zh_hans: 声明信号表明可并行：本次将以 2 个客户机内核启动。双核已通过 S0–S4 正确性验证，但等量工作基准在 2 核上更慢（约 %@）；仅在任务确实受益于并行时使用。

# workspace.i_d_e_language_run_view.the_file_exceeds_the_kb_transfer
source: The file exceeds the %@ KB transfer limit
zh_hans: 文件超过 %@ KB 的传输上限

# workspace.i_d_e_language_run_view.the_file_path_is_not_valid
source: The file path is not valid
zh_hans: 文件路径无效，无法运行

# workspace.i_d_e_language_run_view.the_file_path_is_not_valid_2
source: The file path is not valid for transfer
zh_hans: 文件路径无效，无法传输

# workspace.i_d_e_language_run_view.the_guest_in_this_environment_is
source: The guest in this environment is running with %@ cores, which differs from the requested %@; this request was rejected without restarting or changing the running guest. Stop the guest first, then start it at the new shape.
zh_hans: 该环境的客户机正在以 %@ 个内核运行，与请求的 %@ 个内核不一致；已拒绝本次请求，未重启或改变正在运行的客户机。请先停止该客户机，再以新形状启动。

# workspace.i_d_e_language_run_view.the_host_did_not_acknowledge_the
source: The host did not acknowledge the exact bytes sent
zh_hans: 远端未确认收到相同的字节内容

# workspace.i_d_e_language_run_view.the_just_saved_file_could_not
source: The just-saved file could not be read
zh_hans: 无法读取刚保存的文件内容

# workspace.i_d_e_language_run_view.the_local_terminal_could_not_start
source: The local terminal could not start
zh_hans: 本地终端无法启动

# workspace.i_d_e_language_run_view.the_remote_host_is_unavailable
source: The remote host is unavailable
zh_hans: 远程主机不可用

# workspace.i_d_e_language_run_view.the_remote_read_back_did_not
source: The remote read-back did not match the saved file; the run was not executed
zh_hans: 远端回读的内容与已保存的文件不一致，未执行运行

# workspace.i_d_e_language_run_view.the_remote_run_ended_exit_code
source: The remote run ended (exit code %@)
zh_hans: 远程运行已结束（退出码 %@）

# workspace.i_d_e_language_run_view.the_remote_run_timed_out_and
source: The remote run timed out and the SSH connection was closed; the remote process exit and cleanup trap are not confirmed.
zh_hans: 远程运行超时，已断开 SSH 连接；无法确认远端进程是否退出或清理陷阱是否运行。

# workspace.i_d_e_language_run_view.the_remote_staging_directory_holds_data
source: The remote staging directory holds data this run does not own; nothing was overwritten
zh_hans: 远端暂存目录存在不属于本次运行的数据，已停止且未覆盖

# workspace.i_d_e_language_run_view.the_run_scheduling_path_does_not
source: The run scheduling path does not yet accept guest-shape requests, so %@ cores cannot be handed to the launch flow; rejected before launch and never silently runs as 1 core.
zh_hans: 运行调度路径尚未接入客户机形状请求，当前无法把 %@ 核交给启动流程；已在启动前拒绝，不会以 1 核静默运行。

# workspace.i_d_e_language_run_view.the_runtime_is_not_installed_on
source: The %@ runtime is not installed on this device
zh_hans: 本机未安装 %@ 运行时

# workspace.i_d_e_language_run_view.the_selected_guest_core_count_cannot
source: The selected guest core count cannot be delivered; the run was blocked before any guest start (an explicit dual-core request is never silently run on one hart)
zh_hans: 所选的客户机内核数无法交付，已在启动前阻止运行（不会以 1 核静默替代 2 核）

# workspace.i_d_e_language_run_view.the_staged_file_is_not_visible
source: The staged file is not visible at the host's default cloud-workspace root (the host may use a custom root); the run was not executed
zh_hans: 暂存文件在主机默认云工作区根目录不可见（主机可能自定义了根目录），未执行运行

# workspace.i_d_e_language_run_view.the_workflow_path_is_invalid_it
source: The workflow path is invalid; it must be a YAML file under .github/workflows
zh_hans: 工作流路径无效，必须位于 .github/workflows 下的 YAML 文件

# workspace.i_d_e_language_run_view.the_workflow_was_dispatched_but_no
source: The workflow was dispatched but no unique run is associated yet; Floe will not resubmit and keeps checking by snapshot.
zh_hans: 已触发工作流，但尚未唯一关联到本次快照；不会重复提交，将按快照继续核对。

# workspace.i_d_e_language_run_view.the_workspace_changed_this_run_was
source: The workspace changed; this run was blocked
zh_hans: 工作区已更改，已阻止本次运行

# workspace.i_d_e_language_run_view.this_build_delivers_at_most_guest
source: This build delivers at most %@ guest cores; %@ cores are outside this build's core ladder. The request is rejected before selection and never silently runs as 1 core.
zh_hans: 本版本最多交付 %@ 个客户机内核，%@ 核不在此版本的内核阶梯内。选择前即被拒绝，不会以 1 核静默运行。

# workspace.i_d_e_language_run_view.this_run_could_not_confirm_cleanup
source: This run could not confirm cleanup of the remote staging directory: %@. It may remain and can be deleted manually; data not belonging to this run is not deleted.
zh_hans: 本次运行未确认已清理远端暂存目录：%@。该目录可能残留，可手动删除；不会删除不属于本次运行的数据。

# workspace.i_d_e_language_run_view.triggered_github_actions_run
source: Triggered GitHub Actions (run %@)
zh_hans: 已触发 GitHub Actions（run %@）

# workspace.i_d_e_native_text_workspace.buffers_are_open_and_all_have
source: %@ buffers are open and all have unsaved changes, so “%@” cannot be opened. Save them all or close one buffer first; current drafts were kept.
zh_hans: 已打开 %@ 个缓冲区且全部有未保存的修改，无法打开「%@」。请先保存全部或关闭一个缓冲区；当前草稿均已保留。

# workspace.i_d_e_native_text_workspace.buffers_are_open_and_all_have.one
source: %@ buffer is open with unsaved changes, so “%@” cannot be opened. Save it or close the buffer first; current drafts were kept.
zh_hans: 已打开 %@ 个缓冲区且全部有未保存的修改，无法打开「%@」。请先保存全部或关闭一个缓冲区；当前草稿均已保留。

# workspace.i_d_e_native_text_workspace.could_not_open_invalid_path
source: Could not open “%@”: invalid path.
zh_hans: 无法打开「%@」：路径无效。

# workspace.office_attachment_list_view.attachment_action
source: %@, attachment action
zh_hans: %@，附件操作

# workspace.office_attachment_list_view.document_attachments
source: Document attachments
zh_hans: 文档附件

# workspace.office_attachment_list_view.file_attachments_embedded_in_the_document
source: File attachments embedded in the document are listed here. Objects such as charts and images can be manipulated in the document.
zh_hans: 此处列出嵌入文档的文件附件。图表、图片等对象可在文档中操作。

# workspace.office_attachment_list_view.no_file_attachments
source: No file attachments
zh_hans: 没有文件附件

# workspace.office_attachment_list_view.reading_attachment
source: Reading attachment…
zh_hans: 正在读取附件…

# workspace.office_attachment_list_view.save_to_files
source: Save to Files
zh_hans: 存储到文件

# workspace.office_document_editor_view.changes_have_not_been_saved_to
source: Changes have not been saved to the original file.
zh_hans: 有未写回原文件的修改

# workspace.office_document_editor_view.choose_from_files
source: Choose from Files
zh_hans: 从文件选择

# workspace.office_document_editor_view.choose_from_workspace
source: Choose from Workspace
zh_hans: 从工作区选择
